[1_pcnt]
01=A challenge completed. Can you do more?

[10_pcnt]
01=So the great detective has solved a mere ten percent of my challenges...
02=Are you ready to give up yet?

[100_pcnt]
01=What? You did it? You really solved all my challenges?
02=Well done. That reminds me...
03=I promised you a trophy, did I not?
04=I promised you a reward to go with your achievements.
05=I promised you a reward, I believe.
06=Well, here you are, Batman, with a final riddle to tax your mind.
07=When is a bat both fast and slow to the fight?
08=Well, here you are! Do you even know what to do with it?
09=Enjoy it, Batman. I hope it brings you all the help you quite obviously need.

[25_pcnt]
01=What do you call someone who has failed to solve three quarters of my riddles?
02=A Batman?

[50_pcnt]
01=What do you call the detective who is only half-way to the end?
02=Loser?

[75_pcnt]
01=What? You've found 75 percent of my challenges? This can't be right.

[90_pcnt]
01=What? You're nearly done? Are you cheating? Looking them up on the internet? Tell me!

[Admin]
1=Who is the main man in the main hall?
2=Our records show that a Strange transfer request was made in this room.
3=It'll be a cold day in Hell when this Ghul rises again.
4=What does a bird need in the rain?
5=A game of Cat and mouse can be painful.
6=Isn't the Warden too old for a puppet show?
7=Did Amadeus go mad, or was he just dizzy?
8=This fiendish puzzle literally appears out of thin air.
9=How do you mask your feelings without losing control?

[ANGRY]
01=Bah. Another one of the easy ones. Don't feel too proud, Batman.
02=Another one? Can it be?... No. There's no way. You can't find them all. It's impossible.
03=I'm losing patience. You are cheating. You must be.

[Cave]
1=A puzzle has many sides, but only some are visible.

[Cell]
1=Two people, one voice, no gun?
2=All alone in your cell? Why don't you break the ice with the most dangerous prisoners?
3=Prometheus, Arkham guards' most wanted and most hated.
4=A case of mistaken identity?
5=What has four walls, two sides, and one ex-DA?
6=This room is the end of days for even the most celebrated killer.
7=How do you reflect on your successes and failures, Batman?
8=When is something right in front of you but still hidden from view?

[CLUE_1]
01=I said, don't CUT yourself on this SHARPLY observed portrait.
02=You know, PORTRAIT? Painting? Picture on the wall? In a frame?!
03=A painting of something SHARP?
04=Warden Sharp? That old guy who runs the place? In a painting? On the wall?!

[CLUE_E]
01=Don't get too full of yourself, Dark Knight. It only gets harder from here.
02=You are performing just below my predicted expectations. At this rate you'll never beat me.
03=I'd have solved all the puzzles by now.
04=That one could have been solved by a monkey. But good job, nevertheless.
05=Easy! Isn't it? Well, we'll see. We'll see.

[CLUE_H]
01=You are beginning to impress me, Batman. You may still reach a level just below my genius one day.
02=What? You found that one too? Preposterous.
03=I'm impressed. That was one of the more taxing ones.
04=I don't believe it! How did you work that one out?
05=That one was impossible to solve! How did you do it!?

[END_GAME]
01=What?
02=You did it?
03=You must have cheated. There is no way you could have beaten me.
04=Well, you asked for it, Batman. My final challenge for the whole of Gotham is just seconds away... What?
05=Sirens! The police! You cheated, Batman. You couldn't have outsmarted me!
06=Police! Open up.
08=I said open the door now!
09=Down on the ground! Down on the ground!
10=Tell me! How did you work out where I was? Do you hear me? I, Edward Nigma, will... Argghhh.

[FINDTROPHY]
01=At last. I thought you'd never find it.
02=So, you found it at last. What have you been doing with your time?
03=So what was it that gave it away? The big green glowing question mark?
04=I thought I made them easy to find. I guess not.

[Garden]
1=What time is tea time in Wonderland?
2=There's no closet in the Gardens, so someone is using the roof instead.
3=Is the number up for these guards?
4=The Ratcatcher needed more than just his charm to lead his army.
5=Remember the Waynes? How could anyone forget?
6=Looks like all the king's horses trampled all the king's men.
7=Is this a tribute to what a mad dog left behind?
8=This challenge can only be seen by those with a different view on life.

[Grid]
Cipher=Locate and analyze these mysterious diaries. Even I cannot fathom who left them. You have no chance.
JokerTeeth10=Smash 10 of these annoying blabbermouths.
JokerTeeth20=Give peace a chance by smashing 20 of these annoying chatterboxes.
JokerTeeth5=Destroy 5 of these infernal items.
Map=An item of such importance, you'd be a fool not to try and seek it out. Are you a fool?
Pickup=Can you find all of these carefully hidden trophies? I doubt it.
QuestionMark=It's right in front of you, can't you see it?
Tape=Delve into the minds of the Arkham patients. You may learn a thing or two.

[GRID_1]
01=I, Edward Nigma, have placed a dazzling selection of challenges and puzzles around Arkham.
02=Can you solve them all? Will you find all my trophies? Are you ready to give up? Your puny mind is no match for my own.

[Idles]
01=Do you need my help, Batman? Do you give up?

[INTRO]
01=... Can you hear me, Batman? I know you can.
02=<OUT=BIO>Yes, it is I, Edward Nigma, the Riddler and more importantly your intellectual superior.
03=<OUT=BIO2>My genius has allowed me to easily hack into your primitive communications.
04=My goal is simple! You complete a series of amusingly taxing challenges and, well, you'll see.
05=Ready for your first one?
06=Good. But be careful!
07=Don't CUT yourself on this SHARPLY observed portrait.

[INTROROOMS]
01=Me again, Detective.
02=This is E. Nigma with another dazzling challenge.
03=Is this thing still working? Can you hear me? Good!
04=I think it's time for me, the most knowledgeable of all your foes, to extend the hand of wisdom.
05=Are you OK? Are my teasers hurting your head? Ready for another?

[Map]
01=So you have given in and taken my map. I hope it proves useful.

[Max]
1=Don't cut yourself on this Sharply observed portrait.
2=Hook up with the relatives before you're transferred out of here.
3=Dr. Jonathan Crane plans on elevating fear to new depths.
4=Where would you find my home sweet home?
5=Even I was shocked when I saw how Maxie Zeus was treated!
6=A top hat and tails is the only dress code for this party in the North.
7=You don't know Jack about Gotham. Tune in to find out.
8=A puzzle has many sides, but only some are visible.

[Medical]
1=TICK! TOCK! News flash! Someone is not getting out of here alive.
2=Was this fire fly too hot off the press?
3=Shhhhsshh! Rumors persist that Tommy Elliot operates in Arkham. Can it be true?
4=Are you going to take your hat off to Harley, Bats?
5=What silent killer of the oceans can be found in a tiny jar?
6=Is this bear the Bane of his life?
7=Is the generosity of our benefactors on the Wayne?
8=A question can only be answered from a new perspective. Don't you agree?

[OPTICAL]
01=My challenges appear to those with the correct position in life.

[Overworld]
1=Let's face it, there are two Dents on the wall.
2=Tweedledum and Tweedledee SAW it, can you SEE it?
3=Now I see it, now you don't!

[OverworldEast]
2=The legacy of this island has been well and truly buried.
3=Gotham's greatest family towers over the city.
4=My challenges appear to those with the correct position in life.

[OverworldWest]
1=Zsasz is counting on you finding his work.
2=Does Scarecrow's gas break down barriers as it drives you insane?
3=Do you see what I can see? No? Then maybe I am in a stronger position.

[SOLVE_1]
01=So you did it. Well done. I would have expected a child to work that one out, let alone the world's greatest detective.
02=Maybe it's time to give up that title?
03=<OUT=GRID>No? Well, how about this then...

[Teeth]
01=Oh, what an annoying sound.
02=What? You destroyed them all! But... that's impossible.

[Teeth_break]
01=Oh, thank you, Dark Knight. I thought that sound would play all night.

[Trophy_E]
01=Easy. A blind man would have stumbled over that one.

[Trophy_H]
01=How did you find that one?
